In [5]:
import numpy as np 
import pandas as pd

In [6]:
# Create a Series
s = pd.Series([1, 2, 3, np.nan, 5, 6])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [8]:
# Create a DataFrame by passing a numpy array, with a datetime index and labeled columns
data = [
    ['John', 28, 1.82],
    ['Anna', 24, 1.65],
    ['Peter', 35, 1.76],
    ['Linda', 32, 1.79],
    ['Alice', 41, 1.69],
    ['Carl', 29, 1.72],
]

df = pd.DataFrame(data, columns=['name', 'age', 'height'])
# View top rows
df.head()

    name  age  height
0   John   28    1.82
1   Anna   24    1.65
2  Peter   35    1.76
3  Linda   32    1.79
4  Alice   41    1.69

In [12]:
data = {
    'name': ['John', 'Anna', 'Peter', 'Linda'],
    'age': [28, 24, 35, 32],
    'city': ['New York', 'Paris', 'Berlin', 'London']
}

df = pd.DataFrame(data)

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [13]:
df[df.age > 30]  # returns people older than 30

    name  age    city
2  Peter   35  Berlin
3  Linda   32  London